IDEA StatiCa Open Model
Segment3D Constructor
Compatible with IDEA StatiCa Beta 21.0 - beta
Initializes a new instance of the Segment3D class
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
protected Segment3D()
Protected Sub New
protected:
Segment3D()
See Also
Reference
Segment3D Class
IdeaRS.OpenModel.Geometry3D Namespace